In [2]:
import pandas as pd
import numpy as np

In [4]:
zoo = pd.read_csv('zoo.csv', delimiter = ',')

In [5]:
#Let’s count the number of rows (the number of animals) in zoo!

In [7]:
zoo[['animal']].count()

animal    22
dtype: int64

In [8]:
zoo.animal.count()

22

In [9]:
#Let’s calculate the total water_need of the animals!

In [10]:
zoo.water_need.sum()

7650

In [11]:
zoo.sum()

animal        elephantelephantelephanttigertigertigertigerti...
uniq_id                                                   22253
water_need                                                 7650
dtype: object

In [12]:
#Let’s find out which is the minimum and maximum water_need value!

In [13]:
zoo.water_need.min()

80

In [14]:
zoo.water_need.max()

600

In [15]:
#Let’s find out which is the mean and median water_need value!

In [16]:
zoo.water_need.mean()

347.72727272727275

In [17]:
zoo.water_need.median()

325.0

In [18]:
#Pandas groupby in action

In [19]:
zoo.groupby('animal').mean()

          uniq_id  water_need
animal
elephant   1002.0  550.000000
kangaroo   1021.0  416.666667
lion       1017.5  477.500000
tiger      1006.0  310.000000
zebra      1012.0  184.285714

In [20]:
zoo.groupby('animal').mean()[['water_need']]

          water_need
animal
elephant  550.000000
kangaroo  416.666667
lion      477.500000
tiger     310.000000
zebra     184.285714

In [21]:
zoo.groupby('animal').mean().water_need

animal
elephant    550.000000
kangaroo    416.666667
lion        477.500000
tiger       310.000000
zebra       184.285714
Name: water_need, dtype: float64

In [22]:
zoo.groupby('animal').max()[['water_need']]

          water_need
animal
elephant         600
kangaroo         430
lion             600
tiger            330
zebra            240

In [23]:
zoo.groupby('animal').min()[['water_need']]

          water_need
animal
elephant         500
kangaroo         410
lion             390
tiger            290
zebra             80

In [27]:
# Kembali ke file pandas_tutorial_read.csv

In [35]:
article_read = pd.read_csv('pandas_tutorial_read.csv', delimiter=';', names = ['my_datetime', 'event', 'country', 'user_id', 'source', 'topic'])

In [29]:
#What’s the most frequent source in the article_read dataframe?

In [37]:
article_read.head()

           my_datetime event    country     user_id   source          topic
0  2018-01-01 00:01:01  read  country_7  2458151261      SEO  North America
1  2018-01-01 00:03:20  read  country_7  2458151262      SEO  South America
2  2018-01-01 00:04:01  read  country_7  2458151263  AdWords         Africa
3  2018-01-01 00:04:02  read  country_7  2458151264  AdWords         Europe
4  2018-01-01 00:05:03  read  country_8  2458151265   Reddit  North America

In [39]:
article_read.groupby('source').count()

         my_datetime  event  country  user_id  topic
source
AdWords          500    500      500      500    500
Reddit           949    949      949      949    949
SEO              346    346      346      346    346

In [40]:
article_read.groupby('country').count()

           my_datetime  event  user_id  source  topic
country
country_1           36     36       36      36     36
country_2          462    462      462     462    462
country_3           36     36       36      36     36
country_4           81     81       81      81     81
country_5          409    409      409     409    409
country_6          245    245      245     245    245
country_7          373    373      373     373    373
country_8          153    153      153     153    153

In [41]:
article_read.groupby('topic').count()

               my_datetime  event  country  user_id  source
topic
Africa                 125    125      125      125     125
Asia                   667    667      667      667     667
Australia              121    121      121      121     121
Europe                 322    322      322      322     322
North America          326    326      326      326     326
South America          234    234      234      234     234

In [42]:
#Test yourself #2
#For the users of country_2, what was the most frequent topic 
#and source combination? Or in other words: which topic, 
#from which source, brought the most views from country_2?

In [43]:
article_read[article_read.country == 'country_2'].groupby(['source', 'topic']).count()

                       my_datetime  event  country  user_id
source  topic
AdWords Africa                   3      3        3        3
        Asia                    31     31       31       31
        Australia                6      6        6        6
        Europe                  46     46       46       46
        North America           11     11       11       11
        South America           14     14       14       14
Reddit  Africa                  24     24       24       24
        Asia                   139    139      139      139
        Australia               18     18       18       18
        Europe                  29     29       29       29
        North America           27     27       27       27
        South America           26     26       26       26
SEO     Africa                   7      7        7        7
        Asia                     9      9        9        9
        Australia               10     10       10       10
        Europe                   4      4        4        4
        North America           42     42       42       42
        South America           16     16       16       16